{
  "session_id": "6cac2d8a-a021-45e6-a040-b5d0b246506a",
  "start_time": "2026-01-14T12:57:28.803909",
  "end_time": "2026-01-14T13:10:47.226425",
  "total_duration_minutes": 13.307041933333332,
  "total_words": 1076,
  "average_wpm": 80.85944309716837,
  "overall_accuracy": null,
  "average_confidence": 0.0,
  "total_miscue_counts": {
    "omissions": 0,
    "insertions": 0,
    "substitutions": 0,
    "repetitions": 96,
    "self_corrections": 17,
    "hesitations": 60,
    "total": 173
  },
  "batch_metrics": [
    {
      "batch_id": "6e8da95b-03d4-4848-b025-f198a8673d78",
      "session_id": "6cac2d8a-a021-45e6-a040-b5d0b246506a",
      "start_time": "2026-01-14T12:57:32.308063",
      "end_time": "2026-01-14T12:58:34.606245",
      "duration_seconds": 62.298182,
      "word_count": 43,
      "words_per_minute": 64.5283677780517,
      "average_confidence": 0.0,
      "miscue_counts": {
        "omissions": 0,
        "insertions": 0,
        "substitutions": 0,
        "repetitions": 7,
        "self_corrections": 1,
        "hesitations": 4,
        "total": 12
      },
      "miscue_events": [],
      "expected_text": null,
      "accuracy_percentage": null,
      "transcriptions": [
        "You need that worm, break dance.",
        "that they have where",
        "what's your interest?",
        "that",
        "Yeah, yeah, those are like",
        "I have",
        "one.",
        "it's not.",
        "Oh, OK. Is it so they design like they kind of like it. It's simply stuck on.",
        "Um, I think let's, let's see what this guy is doing.",
        "I'm, I'm not using it at the moment. I'm, I'm just, uh, yeah, he's a."
      ]
    },
    {
      "batch_id": "dc7f40af-148a-48b2-97a8-aec28bd3eea7",
      "session_id": "6cac2d8a-a021-45e6-a040-b5d0b246506a",
      "start_time": "2026-01-14T12:58:43.117535",
      "end_time": "2026-01-14T12:59:53.012695",
      "duration_seconds": 69.89516,
      "word_count": 89,
      "words_per_minute": 123.61370944712051,
      "average_confidence": 0.0,
      "miscue_counts": {
        "omissions": 0,
        "insertions": 0,
        "substitutions": 0,
        "repetitions": 6,
        "self_corrections": 2,
        "hesitations": 5,
        "total": 13
      },
      "miscue_events": [],
      "expected_text": null,
      "accuracy_percentage": null,
      "transcriptions": [
        "I don't I just want to download my I.",
        "OK, that's so they can have Oh, this is what it looks like.",
        "OK, I'm, I'm",
        "OK, this is the right",
        "so it's thinking of using QBC so it's thinking of using QBC to create all the nice reports which can be viewed by the admins. I think the only question is how do we generate those reports and how do they end up in kickssu. So currently it's I was just gonna say, currently, yeah, I'm trying to add that to the the back and so not only have we got the live update per session, but when",
        "we squish those all together, we get one per session. So then we saved that metadata essentially to a DynamoDB instance, which is assigned to student. We need to commute from here to do that analysis."
      ]
    },
    {
      "batch_id": "fdb5df03-e665-47dd-9357-501eed115ea5",
      "session_id": "6cac2d8a-a021-45e6-a040-b5d0b246506a",
      "start_time": "2026-01-14T13:00:23.944527",
      "end_time": "2026-01-14T13:01:26.860712",
      "duration_seconds": 62.916185,
      "word_count": 186,
      "words_per_minute": 256.5317652365604,
      "average_confidence": 0.0,
      "miscue_counts": {
        "omissions": 0,
        "insertions": 0,
        "substitutions": 0,
        "repetitions": 14,
        "self_corrections": 2,
        "hesitations": 4,
        "total": 20
      },
      "miscue_events": [],
      "expected_text": null,
      "accuracy_percentage": null,
      "transcriptions": [
        "offline and then see if that in maybe another an table. Yeah, although, because we're trying to do the real-time stuff anyway. The analysis we we're doing real-time as is. So we can just then squash it and then send that, we can just do the analysis real time, we don't necessarily need a set for a bit to do because it isn't essentially all we do is assess the, the meta",
        "data of, you know, the emissions, so I can, etc. and then that will be in DynamoDB and then the analysis, if you'd like, I guess we can rely on Quick do we need to do that in real time because that might slow down the application it's running on a 2nd, 2nd model, um, but whether we need to or not, but essentially it will also mean that at the end of the session, we can show them a summary screen of, of",
        "that that progress, the words and all, all of that, and it is batched, it's not, it's not complete real time, so it's every, but we can change that batch to 5 minutes or something. But the, the general theme is to, I guess, show the trajectory of the call, um, but I, I, I see from a cost perspective, offloading it to a a back uh a back end like a lambda or something, would make sense, um, in terms of what we build for this MVP though.",
        "Yeah, I see other point is that we don't necessarily have to show a summary back to the students not useful to them, right?"
      ]
    },
    {
      "batch_id": "3021242f-f25b-4097-907a-cb986b4e50fe",
      "session_id": "6cac2d8a-a021-45e6-a040-b5d0b246506a",
      "start_time": "2026-01-14T13:01:59.798714",
      "end_time": "2026-01-14T13:03:27.442147",
      "duration_seconds": 87.643433,
      "word_count": 243,
      "words_per_minute": 221.8078335658075,
      "average_confidence": 0.0,
      "miscue_counts": {
        "omissions": 0,
        "insertions": 0,
        "substitutions": 0,
        "repetitions": 28,
        "self_corrections": 3,
        "hesitations": 19,
        "total": 50
      },
      "miscue_events": [],
      "expected_text": null,
      "accuracy_percentage": null,
      "transcriptions": [
        "No, but, but I guess to the teacher, it will, but also at the end um again I speak to one of your colleagues and it's saying like it might be useful to show them like which words in particular they are, they've struggled more with and that kind of thing. So I think there is benefit to surfacing some of that analysis, um, yeah, then that's, we don't need to show that back to the students. It should be to the admin right? That's my problem.",
        "It's an interesting, I don't know what this whether the students would benefit from seeing it than themselves, um I didn't I didn't do that I don't know, um, sorry, um, yeah, just, just desolation to, um, um, if we're calculating various kind of KPIs based on the heuristics we've discussed, um, dynamically, um, do you think students would benefit from at the end of",
        "that process, uh, kind of seeing some of those KPIs, like what words they maybe mispronounced more the the most or like um I don't know whether they, they, they, they has a a lot. I don't know if that would be a good one. that would be useful for the teachers. I don't think I don't think yeah I if say they, they've like mispronounced hundreds of words I know you could put a limit on it.",
        "but that might make them feel like they're not very good at reading. If you like them, send them with like a list of I think um yeah, it's, it's better so it would be useful information for the teachers, um, because then they can go away work with but not for we tend to not really even, I guess this is like with the current reading program, we don't even tell the children which level they're on. They just, they're just presented with like a Interesting and it doesn't say like level one"
      ]
    },
    {
      "batch_id": "99b54210-95ad-4504-aa79-6fc15ed73663",
      "session_id": "6cac2d8a-a021-45e6-a040-b5d0b246506a",
      "start_time": "2026-01-14T13:03:57.496526",
      "end_time": "2026-01-14T13:04:57.551013",
      "duration_seconds": 60.054487,
      "word_count": 0,
      "words_per_minute": 280.7450507403385,
      "average_confidence": 0.0,
      "miscue_counts": {
        "omissions": 0,
        "insertions": 0,
        "substitutions": 0,
        "repetitions": 0,
        "self_corrections": 0,
        "hesitations": 0,
        "total": 0
      },
      "miscue_events": [],
      "expected_text": null,
      "accuracy_percentage": null,
      "transcriptions": [
        "2. I'm, I'm wondering as well, would it, so you said before that you have like a almost like a moderator that's looking at and we're just wondering about whether this operation should be done in in real time or whether we can just upload it to a back in operation. Would the. the teacher benefit from being able to see, um, like I guess we got 5 students and be able to see perhaps which are struggling more than others based on those KPIs so that they could go over and",
        "help one student more than a more than another. I guess it depends on whether the teacher can like interrupt decision if that do you mean like in real, yeah, I guess as in maybe if the teachers go at the end of this is not in real time. Um, again, I think just like the general information of like what the, what each student has would probably be more beneficial because then they could make a decision on, like, they might",
        "then go, OK, I can reach like 3 or 4 of the students that've had these sessions because they really struggled with their fluency and reading quickly, or they could cro children who were struggling with the vocabulary or their children nursing that, I think, yeah, in real time, I guess one of the things that we're trying to say to teachers and TAs is that they don't really have to do much master sessions going on so they can get on little things so the idea is that they would have, OK, yeah, no, that makes sense. It does, no, it does make sense. It does"
      ]
    },
    {
      "batch_id": "35f1742b-93e8-4757-bb39-bb7e01ebade8",
      "session_id": "6cac2d8a-a021-45e6-a040-b5d0b246506a",
      "start_time": "2026-01-14T13:05:27.342906",
      "end_time": "2026-01-14T13:06:36.335326",
      "duration_seconds": 68.99242,
      "word_count": 186,
      "words_per_minute": 219.1545100171874,
      "average_confidence": 0.0,
      "miscue_counts": {
        "omissions": 0,
        "insertions": 0,
        "substitutions": 0,
        "repetitions": 14,
        "self_corrections": 3,
        "hesitations": 8,
        "total": 25
      },
      "miscue_events": [],
      "expected_text": null,
      "accuracy_percentage": null,
      "transcriptions": [
        "I see, I see what you're, you're thinking comes in. But yeah, I think definitely for the students, they don't need to see any of their KPIs, but for the teachers, it would be useful. OK, and yeah, yeah, not interesting. Anyways, so I have just integrated it into the, um, so it is real time. The whole reason the real-time thing came about as well was around the persona things that I discussed with you, so",
        "the you say real-time when does it happen? So ask, so there's in, in, in the back end, it just puts more load on the back end, so, um, the reading agents and every minute we then batch, send, um, the existing transcript that's so far, analyzed that transcript in isolation, and then produce the the various metrics. So then you can kind of see a graph of them per it's just batching the batching the analysis essentially. So it's not, it",
        "' s not in real time technically, it's batched, but it's um that's currently the the thing that's right, but we can increase the batching as well so.",
        "yeah I mean, yeah, so it's best and stored that data is stored back into another degree that's the intent, yeah, yeah, I haven't, I haven't added that the architecture and for the demo explanation we can show this separately. Uh, does it not, we'll say we have a batch process which will create reports and store them in DynamoDB yeah, based on the, yeah,"
      ]
    },
    {
      "batch_id": "4ac19113-82cb-4dc8-b01a-5295e42fca05",
      "session_id": "6cac2d8a-a021-45e6-a040-b5d0b246506a",
      "start_time": "2026-01-14T13:07:06.607457",
      "end_time": "2026-01-14T13:08:06.482680",
      "duration_seconds": 59.875223,
      "word_count": 186,
      "words_per_minute": 249.51890367072204,
      "average_confidence": 0.0,
      "miscue_counts": {
        "omissions": 0,
        "insertions": 0,
        "substitutions": 0,
        "repetitions": 15,
        "self_corrections": 3,
        "hesitations": 12,
        "total": 30
      },
      "miscue_events": [],
      "expected_text": null,
      "accuracy_percentage": null,
      "transcriptions": [
        "OK, OK, so that means, yeah, so instead of, yeah, we had stored, yeah, the sessions in batches and then analyze the, yeah, OK, I see. Yeah, cool. OK, nice. Um, yeah, that makes sense. The only benefit of keeping it in the server side is that, as I said before, I don't know though with our current thing is, is the Persona update. So if the, if the child is frustrated or whatever and it's and it's maybe it gives a cue to the model to that would then have to go, only be surfaced through that",
        "analysis part to kind of trigger the model to adjust its tone or to uh that's OK, that's a nice ideas maybe not for tomorrow we could, we could touch on it, um, like, like 20 seconds or something. Yeah, yeah, um, because I think that feedback loop is quite a, like in terms of the innovation points, we probably get points for that kind of. Maybe we can",
        "have another slide where we can talk about the next thing that we are planning to do. Yeah, that was another idea as well. I'd be interested, which is um all around, um, uh, speaking to the other guys in in the other room and all around, he, he suggested that we'll make you kind of infer it would take some time, we'd have to gather data and stuff, but like whether a child could potentially be dyslexic versus not dyslexic, um"
      ]
    },
    {
      "batch_id": "f68a9497-7660-407d-b6e6-40f117021bef",
      "session_id": "6cac2d8a-a021-45e6-a040-b5d0b246506a",
      "start_time": "2026-01-14T13:08:37.064137",
      "end_time": "2026-01-14T13:09:36.687630",
      "duration_seconds": 59.623493,
      "word_count": 143,
      "words_per_minute": 216.35766961858474,
      "average_confidence": 0.0,
      "miscue_counts": {
        "omissions": 0,
        "insertions": 0,
        "substitutions": 0,
        "repetitions": 12,
        "self_corrections": 3,
        "hesitations": 8,
        "total": 23
      },
      "miscue_events": [],
      "expected_text": null,
      "accuracy_percentage": null,
      "transcriptions": [
        "based on, um, the, the metrics and and common patterns, but we need to, but you probably need to train a model on, OK, this child's being diagnosed with dyslexic, dyslexia, and they, they have these common traits, um, is that something you think would be interesting. I think it would be interesting, I think, um, there's a whole like it's a bit of a ton of worms with diagnosing it just started I just got it worse.",
        "I'd like I think it would be useful as a piece of evidence potentially yeah, like something to look out for I guess for the teachers I guess, yeah, obviously that would be, you'd need to feed in information so I know what dyslexic. The patterns they present, yeah, exactly with the same model, um, yeah, it's one that I'm, it's one that I'm kind of, I",
        "don't think there's any harm in it because yeah, cos we're not saying they are dyslexic, they're just saying. Exactly, yeah, yeah. And then it could be you are an admin. All of us are at times, they get the support that they qualify that they qualify that they qualify for dyslexic always be a positive because then they have like can see in the data the transcripts like particular"
      ]
    }
  ],
  "all_miscue_events": [],
  "full_transcript": "You need that worm, break dance. that they have where what's your interest? that Yeah, yeah, those are like I have one. it's not. Oh, OK. Is it so they design like they kind of like it. It's simply stuck on. Um, I think let's, let's see what this guy is doing. I'm, I'm not using it at the moment. I'm, I'm just, uh, yeah, he's a. I don't I just want to download my I. OK, that's so they can have Oh, this is what it looks like. OK, I'm, I'm OK, this is the right so it's thinking of using QBC so it's thinking of using QBC to create all the nice reports which can be viewed by the admins. I think the only question is how do we generate those reports and how do they end up in kickssu. So currently it's I was just gonna say, currently, yeah, I'm trying to add that to the the back and so not only have we got the live update per session, but when we squish those all together, we get one per session. So then we saved that metadata essentially to a DynamoDB instance, which is assigned to student. We need to commute from here to do that analysis. offline and then see if that in maybe another an table. Yeah, although, because we're trying to do the real-time stuff anyway. The analysis we we're doing real-time as is. So we can just then squash it and then send that, we can just do the analysis real time, we don't necessarily need a set for a bit to do because it isn't essentially all we do is assess the, the meta data of, you know, the emissions, so I can, etc. and then that will be in DynamoDB and then the analysis, if you'd like, I guess we can rely on Quick do we need to do that in real time because that might slow down the application it's running on a 2nd, 2nd model, um, but whether we need to or not, but essentially it will also mean that at the end of the session, we can show them a summary screen of, of that that progress, the words and all, all of that, and it is batched, it's not, it's not complete real time, so it's every, but we can change that batch to 5 minutes or something. But the, the general theme is to, I guess, show the trajectory of the call, um, but I, I, I see from a cost perspective, offloading it to a a back uh a back end like a lambda or something, would make sense, um, in terms of what we build for this MVP though. Yeah, I see other point is that we don't necessarily have to show a summary back to the students not useful to them, right? No, but, but I guess to the teacher, it will, but also at the end um again I speak to one of your colleagues and it's saying like it might be useful to show them like which words in particular they are, they've struggled more with and that kind of thing. So I think there is benefit to surfacing some of that analysis, um, yeah, then that's, we don't need to show that back to the students. It should be to the admin right? That's my problem. It's an interesting, I don't know what this whether the students would benefit from seeing it than themselves, um I didn't I didn't do that I don't know, um, sorry, um, yeah, just, just desolation to, um, um, if we're calculating various kind of KPIs based on the heuristics we've discussed, um, dynamically, um, do you think students would benefit from at the end of that process, uh, kind of seeing some of those KPIs, like what words they maybe mispronounced more the the most or like um I don't know whether they, they, they, they has a a lot. I don't know if that would be a good one. that would be useful for the teachers. I don't think I don't think yeah I if say they, they've like mispronounced hundreds of words I know you could put a limit on it. but that might make them feel like they're not very good at reading. If you like them, send them with like a list of I think um yeah, it's, it's better so it would be useful information for the teachers, um, because then they can go away work with but not for we tend to not really even, I guess this is like with the current reading program, we don't even tell the children which level they're on. They just, they're just presented with like a Interesting and it doesn't say like level one 2. I'm, I'm wondering as well, would it, so you said before that you have like a almost like a moderator that's looking at and we're just wondering about whether this operation should be done in in real time or whether we can just upload it to a back in operation. Would the. the teacher benefit from being able to see, um, like I guess we got 5 students and be able to see perhaps which are struggling more than others based on those KPIs so that they could go over and help one student more than a more than another. I guess it depends on whether the teacher can like interrupt decision if that do you mean like in real, yeah, I guess as in maybe if the teachers go at the end of this is not in real time. Um, again, I think just like the general information of like what the, what each student has would probably be more beneficial because then they could make a decision on, like, they might then go, OK, I can reach like 3 or 4 of the students that've had these sessions because they really struggled with their fluency and reading quickly, or they could cro children who were struggling with the vocabulary or their children nursing that, I think, yeah, in real time, I guess one of the things that we're trying to say to teachers and TAs is that they don't really have to do much master sessions going on so they can get on little things so the idea is that they would have, OK, yeah, no, that makes sense. It does, no, it does make sense. It does I see, I see what you're, you're thinking comes in. But yeah, I think definitely for the students, they don't need to see any of their KPIs, but for the teachers, it would be useful. OK, and yeah, yeah, not interesting. Anyways, so I have just integrated it into the, um, so it is real time. The whole reason the real-time thing came about as well was around the persona things that I discussed with you, so the you say real-time when does it happen? So ask, so there's in, in, in the back end, it just puts more load on the back end, so, um, the reading agents and every minute we then batch, send, um, the existing transcript that's so far, analyzed that transcript in isolation, and then produce the the various metrics. So then you can kind of see a graph of them per it's just batching the batching the analysis essentially. So it's not, it ' s not in real time technically, it's batched, but it's um that's currently the the thing that's right, but we can increase the batching as well so. yeah I mean, yeah, so it's best and stored that data is stored back into another degree that's the intent, yeah, yeah, I haven't, I haven't added that the architecture and for the demo explanation we can show this separately. Uh, does it not, we'll say we have a batch process which will create reports and store them in DynamoDB yeah, based on the, yeah, OK, OK, so that means, yeah, so instead of, yeah, we had stored, yeah, the sessions in batches and then analyze the, yeah, OK, I see. Yeah, cool. OK, nice. Um, yeah, that makes sense. The only benefit of keeping it in the server side is that, as I said before, I don't know though with our current thing is, is the Persona update. So if the, if the child is frustrated or whatever and it's and it's maybe it gives a cue to the model to that would then have to go, only be surfaced through that analysis part to kind of trigger the model to adjust its tone or to uh that's OK, that's a nice ideas maybe not for tomorrow we could, we could touch on it, um, like, like 20 seconds or something. Yeah, yeah, um, because I think that feedback loop is quite a, like in terms of the innovation points, we probably get points for that kind of. Maybe we can have another slide where we can talk about the next thing that we are planning to do. Yeah, that was another idea as well. I'd be interested, which is um all around, um, uh, speaking to the other guys in in the other room and all around, he, he suggested that we'll make you kind of infer it would take some time, we'd have to gather data and stuff, but like whether a child could potentially be dyslexic versus not dyslexic, um based on, um, the, the metrics and and common patterns, but we need to, but you probably need to train a model on, OK, this child's being diagnosed with dyslexic, dyslexia, and they, they have these common traits, um, is that something you think would be interesting. I think it would be interesting, I think, um, there's a whole like it's a bit of a ton of worms with diagnosing it just started I just got it worse. I'd like I think it would be useful as a piece of evidence potentially yeah, like something to look out for I guess for the teachers I guess, yeah, obviously that would be, you'd need to feed in information so I know what dyslexic. The patterns they present, yeah, exactly with the same model, um, yeah, it's one that I'm, it's one that I'm kind of, I don't think there's any harm in it because yeah, cos we're not saying they are dyslexic, they're just saying. Exactly, yeah, yeah. And then it could be you are an admin. All of us are at times, they get the support that they qualify that they qualify that they qualify for dyslexic always be a positive because then they have like can see in the data the transcripts like particular you know, behaviors, not just through word of mouth, but through the statistics at least, which is one of the benefits of doing it like this as opposed to just subjective. OK, cool the community recently because Interesting, because I, I think this would be really good for the um innovation marks is this potential dyslexic, um notes and I think that from a presentation perspective as well, it would be worth mentioning, um, um.",
  "expected_passage": null,
  "insights": {
    "reading_speed": "on_grade_level",
    "reading_speed_note": "Reading speed of 81 WPM is within typical range",
    "dominant_miscue_type": "repetitions",
    "dominant_miscue_count": 96,
    "recommendation": "Work on confidence and fluency through repeated reading",
    "self_correction_rate": 10.897435897435898,
    "self_monitoring": "Encourage the student to self-monitor and self-correct more actively",
    "total_miscues": 156,
    "total_words": 1076,
    "miscue_rate": 14.49814126394052,
    "batches_analyzed": 8
  }
}